{
  "main": {
    "name": "Kyle Cheung",
    "occupation": "Full-Stack Developer",
    "description": "In the business of turning ideas into realities",
    "image": "profilepic.jpg",
    "bio": "I am a Toronto based Full-Stack Developer with experience in a variety of technologies. My passion for building started at a young age when I was gifted my first Lego set. I'd spend hours in my bedroom putting blocks together to build robots and whatever else I could think of. Programming, similarly is about taking fundamental concepts and adding those blocks together. Everything starts with the basics, which is why I enjoy experimenting with as many things as possible and expanding my breadth of knowledge. Currently, I specialize in developing using a JavaScript stack. I strongly believe that Progressive-Web-Apps are the future. As people move away from laptops and desktop computers, smartphones become more essential in everyday life. I aim to deliver a valuable and consistent product across devices at the touch of a finger. My interests include Machine Learning and Artificial Intelligence. Data excites me, and the many possible applications in the future keep me eager to learn.",
    "email": "Cheung.Kyle1@gmail.com",
    "phone": "1-647-546-6991",
    "website": "http://www.kylecheung.ca",
    "resumedownload": "https://drive.google.com/file/d/1jKiq-3c5S8SysvLdRDmr5tnf08byROMG/view?usp=sharing",
    "social": [
      {
        "name": "facebook",
        "url": "http://facebook.com/k4iru",
        "className": "fa fa-facebook"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/k4iru/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/k4iru",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "education": [
      {
        "school": "Humber College",
        "degree": "Post Graduate - Web Development",
        "graduated": "June 2021",
        "description": "Web Programming, Digital Design, Database Design, Security and Quality Assurance, Mobile Development, Usability and Accessibility"
      },
      {
        "school": "University of Western Ontario",
        "degree": "BSc - Computer Science",
        "graduated": "May 2019",
        "description": "Data Structures & Algorithms, Operating Systems, Linear Algebra, Databases, Computer Networks, Software Design & Analysis, Artificial Intelligence, Software Tools, & Systems Programming, Human-Computer Interaction"
      }
    ],
    "work": [
      {
        "company": "C.D. Howe Institute",
        "title": "Contract Web Developer",
        "years": "October 2018 - February 2019",
        "url": "",
        "description": "Contracted <strong>to</strong> develop a Generational Accounting Calculator using React. I was in charge of building the app from the ground up and styling it using CSS and Javascript. I ensured browser compatibility with Internet Explorer as well as helped the employer set set up custom domains and launch the application."
      },
      {
        "company": "Edmonton Public School Board",
        "title": "I.T. Technician",
        "years": "June 2017 - August 2017",
        "url": "",
        "description": "I was responsible for conversing with clients and troubleshooting technical problems as smoothly as possible. I learned how to explain complex concepts as simply as possible as well as learning how to use administrative software to remotely help clients as well."
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "My Portfolio Site",
        "category": "React, Javascript",
        "image": "personalsite.jpg",
        "github": "https://github.com/k4iru/personal-site",
        "url": "https://www.kylecheung.ca/",
        "description": "As a developer my portfolio and personal brand are extremely important. Often it's the first thing potential employers see when looking at my work. Therefore, I decided to build my portfolio website from scratch. No cookie cutter wordpress templates here! All components are built using React. Styling is done with a focus on accessibility and mobile first responsiveness. Portfolio information is read from a JSON file that reads on page load. Behind the scenes this site is hosted on a linux server configured with nginx along with all my other projects."
      },
      {
        "title": "Starry",
        "category": "React, Javascript, Node, Express",
        "image": "starry.JPG",
        "github": "https://github.com/k4iru/starry-night",
        "url": "https://starry.kylecheung.ca/",
        "description": "This is an app I made to better find astronomy weather forecasts. This app is built with mobile design in mind for when you're out and need to quickly check. The app is built using React on the front end and Node/Express for the server. The app works by calling on the popular dark sky api and formatting the data as well as caching searches in the database to limit api calls."
      },
      {
        "title": "Discussion Board",
        "category": "PHP, HTML, CSS, Authentication, MySQL",
        "image": "discussion.JPG",
        "github": "https://github.com/k4iru/discussion/tree/dev",
        "url": "https://discussion.kylecheung.ca/",
        "description": "This is a discussion board I created in PHP. Some key features are Authentication and some more extensive SQL operations. Designed with security in mind. Authentication is fully encrypted and uses sessions with an expiration date."
      },
      {
        "title": "Just Cook (WIP)",
        "category": "React, Javascript, Node, Express, Authentication, Mongodb",
        "image": "justcook.JPG",
        "github": "https://github.com/k4iru/JustCook",
        "url": "https://justcook.live/",
        "description": "Just Cook is a progressive web app built for the professional that loves to cook, but doesn't have a lot of time to take a shopping detour. Users can save recipes that they want to make and the app will automatically order the groceries necessary. Built using React for the front end. Express, Node for the backend and Mongodb as the database for storing recipes and user information. Bootstrapped using my Full Stack JavaScript template."
      },
      {
        "title": "Covid Tracker",
        "category": "React, Javascript, React-Hooks",
        "image": "vaccine.JPG",
        "github": "https://github.com/k4iru/covid-19",
        "url": "https://vaccine.kylecheung.ca/",
        "description": "This project was built to help me update my React knowledge. Components are built using Functional Component syntax, await/async, and React-hooks. The app layout is completely responsive with flexbox. I decided to also use Material-ui to style in order to learn new css frameworks."
      }
    ]
  }
}
